---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSize.InnerDiameter
source: html/be149324-0b00-d23c-1291-f94c293356e7.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize.InnerDiameter Property

Inner diameter

## Syntax (C#)
```csharp
public double InnerDiameter { get; }
```